cache/posts/machine-learning-recap.html
<div id="outline-container-org255f5b7" class="outline-2">
<h2 id="org255f5b7">The Main Categories</h2>
<div class="outline-text-2" id="text-org255f5b7">
<p>
These are the four main categories of supervised machine learning algorithms that you'll encounter in kaggle competitions.
</p>

<ul class="org-ul">
<li>Linear Models
<ul class="org-ul">
<li>sklearn</li>
<li>vowpal rabbit (for really large datasets)</li>
</ul></li>
<li>Tree-Based Models
<ul class="org-ul">
<li>sklearn</li>
<li>xgboost: faster than sklearn</li>
</ul></li>
<li>k-Nearest Neighbors
<ul class="org-ul">
<li>sklearn</li>
</ul></li>
<li>Neural Networks</li>
</ul>
</div>
</div>
<div id="outline-container-org6a65f91" class="outline-2">
<h2 id="org6a65f91">The No Free Lunch Theorem</h2>
<div class="outline-text-2" id="text-org6a65f91">
<blockquote>
<p>
There is no method which outperforms all others for all tasks.
</p>
</blockquote>

<p>
You cannot assume that an algorithm that did well on one set of data will do well on another. All algorithms have weaknesses, so you have to test multiple algorithms on each data set.
</p>
</div>
</div>
<div id="outline-container-orge14962d" class="outline-2">
<h2 id="orge14962d">Summary</h2>
<div class="outline-text-2" id="text-orge14962d">
<ul class="org-ul">
<li>there is no one algorithm to rule them all</li>
<li>Linear models split spaces into two sub-spaces</li>
<li>tree-based models spit spaces into boxes</li>
<li>kNN relies on measuring the 'closeness' between points</li>
<li>Neural Networks provide non-linear decision boundaries</li>
</ul>

<p>
In general the two most powerful methods are <b>Gradient Boosted Decision Trees</b> and <b>Neural Networks</b>, but this won't always be the case.
</p>
</div>
</div>
